app/Controllers/Car.php

    public function getCarDetail($id)
    {
        $model = new \App\Models\CarModel();
        helper('form');

        $car = $model->find($id);
---
SELECT *
FROM `car`
WHERE `car`.`id` = '10'