app/Controllers/User.php

    public function getList()
    {
        $userModel = new \App\Models\UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `user`